z-mnp-test/sss.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><ns:processNPCMsg xmlns:ns="http://ws.clearinghouse.com"><ns:userId>catToClh</ns:userId><ns:password>Y2F0VG9DbGg=</ns:password><ns:xmlMsg>&lt;?xml version="1.0" encoding="UTF-8" standalone="yes"?&gt;&lt;NPCMessageData&gt;&lt;NPCData&gt;&lt;MessageHeader&gt;&lt;PortType&gt;1&lt;/PortType&gt;&lt;MessageID&gt;2001&lt;/MessageID&gt;&lt;SoapRequestId&gt;970&lt;/SoapRequestId&gt;&lt;MessageCreateTimeStamp&gt;20171229155228&lt;/MessageCreateTimeStamp&gt;&lt;Sender&gt;CATCDMA&lt;/Sender&gt;&lt;Receiver&gt;CRDB&lt;/Receiver&gt;&lt;/MessageHeader&gt;&lt;NPCMessages&gt;&lt;PortReversalDonor&gt;&lt;Zone&gt;4&lt;/Zone&gt;&lt;OperatorCode&gt;08&lt;/OperatorCode&gt;&lt;MSISDN&gt;0864296461&lt;/MSISDN&gt;&lt;PortId&gt;20140731182144DTN2543&lt;/PortId&gt;&lt;/PortReversalDonor&gt;&lt;/NPCMessages&gt;&lt;MessageFooter&gt;&lt;Checksum&gt;1&lt;/Checksum&gt;&lt;/MessageFooter&gt;&lt;/NPCData&gt;&lt;/NPCMessageData&gt;</ns:xmlMsg></ns:processNPCMsg></soap:Body></soap:Envelope>